Revit 2024 API
RebarCoupler.GetCouplerPositionTransform Method
 Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public Transform GetCouplerPositionTransform(
	int couplerPositionIndex
)
Visual Basic
Public Function GetCouplerPositionTransform ( _
	couplerPositionIndex As Integer _
) As Transform
Visual C++
public:
Transform^ GetCouplerPositionTransform(
	int couplerPositionIndex
)
Parameters
couplerPositionIndex
Type: System.Int32
 An index between 0 and (CouplerQuantity-1).
Return Value
 Returns a transformation that is composed from : - a translation from (0, 0, 0) to coupler origin - a rotation that will align the coupler with the bar segment on which it stays.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  couplerPositionIndex is not in the range [ 0, CouplerQuantity-1 ].
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace